// ================================
// Задание 1. Алгоритм по блок-схеме (с циклом)
// ================================

let a = 5;

while (true) {
  if (a > 10) {
    console.log('a > 10');
    break; // стоп по блок-схеме
  } else {
    a = a + 1;
  }
}

// ================================
// Задание 2. Сумма чисел от 1 до N (while)
// ================================

let n = Number(prompt('Введите число N'));
let sum = 0;
let i = 1;

while (i <= n) {
  sum += i;
  i++;
}

console.log('Сумма чисел от 1 до ' + n + ' = ' + sum);

// ================================
// Задание 3. Делители числа (for)
// ================================

let number = Number(prompt('Введите целое положительное число'));

console.log('Делители числа ' + number + ':');

for (let i = 1; i <= number; i++) {
  if (number % i === 0) {
    console.log(i);
  }
}
